app/controllers/sessions_controller.rb

  def new
    @user = User.new
    @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", 1903334959725593], ["LIMIT", 1]]

  def create_oath
    puts auth
    @user = User.find_or_create_by(uid: auth['uid']) do |u|
---
INSERT INTO "users" ("username", "email", "uid") VALUES (?, ?, ?)  [["username", "Victoria Fluharty"], ["email", "torianne26@gmail.com"], ["uid", "1903334959725593"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "1903334959725593"], ["LIMIT", 1]]