app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest") VALUES (?, ?, ?)  [["username", "torsaur"], ["email", "torsaur@gmail.com"], ["password_digest", "$2a$10$mlfdKmOVhe0pniLoQKW6c.uCHqeMHHjPiHEBTKTqbghovfbBej1Gq"]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["email", "mrgrey@aol.com"], ["password_digest", "$2a$10$HSod4Zv90GSSnkra8ECxR.iVmcZCMACILiXbVJx7uE7qs0tCoVqEK"], ["id", 9]]