app/models/trip.rb

  def city_attributes=(city_attributes)
    city = City.find_or_create_by(name: city_attributes[:name])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."name" = ? LIMIT ?  [["name", "Los Angeles"], ["LIMIT", 1]]

  def country_attributes=(country_attributes)
    country = Country.find_or_create_by(name: country_attributes[:name])
---
SELECT  "countries".* FROM "countries" WHERE "countries"."name" = ? LIMIT ?  [["name", "USA"], ["LIMIT", 1]]
INSERT INTO "countries" ("name", "native_language") VALUES (?, ?)  [["name", "USA"], ["native_language", "English"]]